-- phpMyAdmin SQL Dump
-- version 4.9.1
-- https://www.phpmyadmin.net/
--
-- ホスト: localhost
-- 生成日時: 2021 年 1 月 09 日 08:46
-- サーバのバージョン： 10.4.8-MariaDB
-- PHP のバージョン: 7.3.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `phpcompetition201912`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `product`
--

CREATE TABLE `product` (
  `id` int(11) NOT NULL,
  `name` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `image` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `price` int(128) NOT NULL,
  `description` varchar(356) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` datetime NOT NULL,
  `user_id` int(11) NOT NULL,
  `category` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `item_condition` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `shipping_fee` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `area` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `necessary_days` varchar(128) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- テーブルのデータのダンプ `product`
--

INSERT INTO `product` (`id`, `name`, `image`, `price`, `description`, `created_at`, `user_id`, `category`, `item_condition`, `shipping_fee`, `area`, `necessary_days`) VALUES
(1, 'iPhone 12', 'upload/20191216050520.png', 150000, 'あああああ', '2019-12-16 13:05:20', 1, '家電・スマホ・カメラ', '新品、未使用', '送料込み（出品者負担）', '福岡県', '1~2日で発送'),
(10, 'ブラックマジシャンガール', 'upload/20191218032948.jpg', 4000, 'いいいいいいいいい', '2019-12-18 11:29:48', 15, 'おもちゃ・ホビー・グッズ', '新品、未使用', '送料込み（出品者負担）', '宮城県', '1~2日で発送'),
(11, 'スイッチ', 'upload/20191218033139.jpg', 25000, '任天堂', '2019-12-18 11:31:39', 15, '本・音楽・ゲーム', '未使用に近い', '送料込み（出品者負担）', '北海道', '1~2日で発送'),
(12, 'ヘッドホン', 'upload/20191218033314.jpg', 5000, 'いい音いい音', '2019-12-18 11:33:14', 15, '家電・スマホ・カメラ', 'やや傷や汚れあり', '送料込み（出品者負担）', '長野県', '1~2日で発送'),
(15, 'レッドアイズ', 'upload/20191218033914.jpg', 4000, 'カッコいいいいいい', '2019-12-18 11:39:14', 15, 'おもちゃ・ホビー・グッズ', '目立った傷や汚れなし', '送料込み（出品者負担）', '佐賀県', '2~3日で発送'),
(16, 'airpods', 'upload/20191218034146.jpeg', 30000, 'ええええええええええ', '2019-12-18 11:41:46', 15, '家電・スマホ・カメラ', '新品、未使用', '送料込み（出品者負担）', '秋田県', '1~2日で発送'),
(18, 'kinki cd', 'upload/20191218034326.jpg', 1000, 'aaaaaaaaaaa', '2019-12-18 11:43:26', 15, '本・音楽・ゲーム', '新品、未使用', '送料込み（出品者負担）', '沖縄県', '1~2日で発送'),
(21, '黒い羽織るやつ', 'upload/20191218035512.jpg', 3000, 'えええええええねん', '2019-12-18 11:55:12', 15, 'レディース', '未使用に近い', '着払い（購入者負担）', '山形県', '2~3日で発送'),
(24, 'フォーマル', 'upload/20191218035817.jpg', 6666, 'あああおいい', '2019-12-18 11:58:17', 15, 'レディース', '新品、未使用', '着払い（購入者負担）', '山形県', '2~3日で発送'),
(25, 'ゆるふわニット', 'upload/20191218035908.jpg', 2000, 'ほほほほほおほほ', '2019-12-18 11:59:08', 15, 'レディース', '新品、未使用', '送料込み（出品者負担）', '北海道', '2~3日で発送'),
(26, '青カーディガン', 'upload/20191218040528.jpeg', 2000, 'いいいいい', '2019-12-18 12:05:28', 15, 'メンズ', '目立った傷や汚れなし', '送料込み（出品者負担）', '新潟県', '1~2日で発送'),
(27, '透け感カーディガン', 'upload/20191218041921.jpg', 4000, 'ああああああ', '2019-12-18 12:19:21', 15, 'メンズ', '新品、未使用', '送料込み（出品者負担）', '東京都', '1~2日で発送'),
(29, 'Tシャツ', 'upload/20191218042051.jpg', 1200, 'いいいいいい', '2019-12-18 12:20:51', 15, 'メンズ', '未使用に近い', '送料込み（出品者負担）', '東京都', '1~2日で発送'),
(31, 'キャメルコート', 'upload/20191218042202.jpeg', 20000, 'ああああああ', '2019-12-18 12:22:02', 15, 'メンズ', '新品、未使用', '送料込み（出品者負担）', '北海道', '2~3日で発送'),
(32, 'スキニーパンツ', 'upload/20191218042239.jpg', 3000, 'あああああああああ', '2019-12-18 12:22:39', 15, 'メンズ', 'やや傷や汚れあり', '送料込み（出品者負担）', '青森県', '2~3日で発送'),
(33, 'スーツ', 'upload/20191218042312.jpg', 50000, 'あああああああ', '2019-12-18 12:23:12', 15, 'メンズ', '新品、未使用', '送料込み（出品者負担）', '北海道', '2~3日で発送'),
(34, 'ダウン', 'upload/20191218042348.jpg', 15000, 'ううううううう', '2019-12-18 12:23:48', 15, 'メンズ', '新品、未使用', '着払い（購入者負担）', '岩手県', '4~7日で発送'),
(35, 'アンパンマン', 'upload/20191218043108.jpg', 400, 'いいいいいい', '2019-12-18 12:31:08', 15, 'おもちゃ・ホビー・グッズ', '目立った傷や汚れなし', '送料込み（出品者負担）', '岩手県', '2~3日で発送'),
(37, 'ロボット', 'upload/20191218043217.jpg', 4000, 'ええええええええええ', '2019-12-18 12:32:17', 15, 'おもちゃ・ホビー・グッズ', '傷や汚れあり', '送料込み（出品者負担）', '静岡県', '1~2日で発送'),
(38, '車模型', 'upload/20191218043300.jpg', 3333, 'いいいいいい', '2019-12-18 12:33:00', 15, 'おもちゃ・ホビー・グッズ', '目立った傷や汚れなし', '送料込み（出品者負担）', '長野県', '2~3日で発送'),
(39, '電子レンジ', 'upload/20191218043428.jpg', 9800, 'うううううううう', '2019-12-18 12:34:28', 15, '家電・スマホ・カメラ', '目立った傷や汚れなし', '送料込み（出品者負担）', '宮城県', '1~2日で発送'),
(40, 'アイロン', 'upload/20191218043459.jpg', 1400, 'ああああああああ', '2019-12-18 12:34:59', 15, '家電・スマホ・カメラ', 'やや傷や汚れあり', '送料込み（出品者負担）', '北海道', '2~3日で発送'),
(41, 'おもちゃ', 'upload/20191218043541.jpg', 3000, 'おもちゃ', '2019-12-18 12:35:41', 15, 'おもちゃ・ホビー・グッズ', '未使用に近い', '送料込み（出品者負担）', '愛知県', '1~2日で発送'),
(42, '冷蔵庫', 'upload/20191218043620.jpg', 3000, 'っっっっ', '2019-12-18 12:36:20', 15, '家電・スマホ・カメラ', '新品、未使用', '送料込み（出品者負担）', '山形県', '2~3日で発送'),
(43, 'テレビ', 'upload/20191218044155.jpg', 30000, 'オオおおおお', '2019-12-18 12:41:55', 15, '家電・スマホ・カメラ', '目立った傷や汚れなし', '送料込み（出品者負担）', '北海道', '1~2日で発送'),
(45, 'ぬいぐるみ', 'upload/20191218044511.jpg', 333, 'いいいいいい', '2019-12-18 12:45:11', 15, 'おもちゃ・ホビー・グッズ', '傷や汚れあり', '送料込み（出品者負担）', '岩手県', '2~3日で発送'),
(46, '掃除機', 'upload/20191218044556.jpg', 2000, 'オオおおおお', '2019-12-18 12:45:56', 15, '家電・スマホ・カメラ', '傷や汚れあり', '着払い（購入者負担）', '青森県', '2~3日で発送'),
(47, 'Macbook', 'upload/20191218044729.jpg', 70000, 'coooool', '2019-12-18 12:47:29', 15, '家電・スマホ・カメラ', '目立った傷や汚れなし', '着払い（購入者負担）', '青森県', '2~3日で発送'),
(48, 'ピカチュウ', 'upload/20191218044817.jpg', 1000, 'かわいいいいい', '2019-12-18 12:48:17', 15, 'おもちゃ・ホビー・グッズ', '未使用に近い', '送料込み（出品者負担）', '北海道', '2~3日で発送'),
(49, 'ベイブレード', 'upload/20191218044948.jpg', 4400, 'ううううううう', '2019-12-18 12:49:48', 15, 'おもちゃ・ホビー・グッズ', '目立った傷や汚れなし', '送料込み（出品者負担）', '福島県', '1~2日で発送'),
(51, 'メンズ財布', 'upload/20191218053946.jpg', 4444, 'いいいいい', '2019-12-18 13:39:46', 15, 'メンズ', 'やや傷や汚れあり', '送料込み（出品者負担）', '香川県', '1~2日で発送'),
(52, 'シャネル', 'upload/20191218054035.jpg', 40000, 'シャネルだよ', '2019-12-18 13:40:35', 15, 'レディース', '新品、未使用', '送料込み（出品者負担）', '群馬県', '2~3日で発送'),
(53, 'ヴィトン', 'upload/20191218054131.jpg', 50000, 'ヴィトンだよ', '2019-12-18 13:41:31', 15, 'レディース', '新品、未使用', '送料込み（出品者負担）', '新潟県', '1~2日で発送'),
(54, 'シュプリーム', 'upload/20191218054215.jpg', 3333, 'シュプリームだよ', '2019-12-18 13:42:15', 15, 'メンズ', '新品、未使用', '着払い（購入者負担）', '青森県', '2~3日で発送'),
(56, 'ギター', 'upload/20191218055831.jpg', 30000, 'ギターだお', '2019-12-18 13:58:31', 15, 'おもちゃ・ホビー・グッズ', 'やや傷や汚れあり', '送料込み（出品者負担）', '富山県', '1~2日で発送'),
(57, 'ビジネススーツ', 'upload/20191218221134.jpg', 3000, 'あああああ', '2019-12-19 06:11:34', 15, 'レディース', '新品、未使用', '着払い（購入者負担）', '北海道', '2~3日で発送'),
(59, 'ブルーアイズ', 'upload/20191219004529.png', 4444, 'めちゃ強い', '2019-12-19 08:45:29', 16, 'おもちゃ・ホビー・グッズ', '新品、未使用', '送料込み（出品者負担）', '北海道', '1~2日で発送'),
(60, 'スマホケース', 'upload/20191219004800.jpg', 3000, '綺麗', '2019-12-19 08:48:00', 16, '家電・スマホ・カメラ', '新品、未使用', '送料込み（出品者負担）', '北海道', '1~2日で発送'),
(62, 'ブルーアイズ', 'upload/20191219024131.png', 4444, 'あああああ', '2019-12-19 10:41:31', 15, 'おもちゃ・ホビー・グッズ', '新品、未使用', '送料込み（出品者負担）', '岐阜県', '2~3日で発送'),
(65, 'カセット', 'upload/20200515133759.jpg', 2000, 'ああああ', '2020-05-15 20:37:59', 22, 'レディース', '未使用に近い', '送料込み（出品者負担）', '宮城県', '4~7日で発送'),
(66, 'oooo', 'upload/20200515134323.jpg', 3000, 'いいい', '2020-05-15 20:43:23', 23, 'レディース', '目立った傷や汚れなし', '送料込み（出品者負担）', '福井県', '2~3日で発送'),
(68, 'スキニージーンズ', 'upload/20201222142712.jpeg', 2980, 'かjl；kfじゃlkjf；ぁkふぁ', '2020-12-22 22:27:12', 25, 'レディース', '新品、未使用', '送料込み（出品者負担）', '北海道', '1~2日で発送'),
(71, 'コート', 'upload/20210109082921.jpeg', 3980, 'ああああああああ', '2021-01-09 16:29:21', 27, 'レディース', '新品、未使用', '送料込み（出品者負担）', '山口県', '1~2日で発送'),
(72, '花', 'upload/20210109083540.jpg', 3000, 'jぁkfj；ヵ', '2021-01-09 16:35:40', 27, 'メンズ', '目立った傷や汚れなし', '送料込み（出品者負担）', '北海道', '2~3日で発送');

-- --------------------------------------------------------

--
-- テーブルの構造 `user_table`
--

CREATE TABLE `user_table` (
  `id` int(128) NOT NULL,
  `nickname` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `family_name` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `given_name` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `family_name_kana` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `given_name_kana` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `year` int(4) NOT NULL,
  `month` int(2) NOT NULL,
  `day` int(2) NOT NULL,
  `kanri_flg` int(1) NOT NULL,
  `life_flg` int(1) NOT NULL,
  `image` varchar(128) COLLATE utf8_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- テーブルのデータのダンプ `user_table`
--

INSERT INTO `user_table` (`id`, `nickname`, `email`, `password`, `family_name`, `given_name`, `family_name_kana`, `given_name_kana`, `year`, `month`, `day`, `kanri_flg`, `life_flg`, `image`) VALUES
(1, 'しの', 'some@gmail.com', '1111', '篠原', '裕貴', 'シノハラ', 'ユウキ', 1988, 8, 9, 1, 0, ''),
(15, 'きら', 'kira@test', 'kira', 'おおおお', 'おおおお', 'オオオオ', 'オオオオ', 1977, 4, 1, 0, 0, ''),
(16, '有村架純', 'kasumi@test', '1111', '堂本', '剛', 'ドウモト', 'ツヨシ', 2019, 1, 2, 0, 0, 'upload/20191218234239.jpg'),
(18, 'ツヨシくん', 'tsuyo@test', '1111', '堂本', '剛', 'ドウモト', 'ツヨシ', 2017, 3, 4, 0, 0, 'upload/20191219014424.jpg'),
(19, 'しの', 'aaa@test.com', '1111', '堂本', '剛', 'ドウモト', 'ツヨシ', 2019, 1, 2, 0, 0, 'upload/20191219023835.jpg'),
(20, 'ジーズ', 'gs@test', '8888', 'ジーズ', 'アカデミー', 'ジーズ', 'アカデミー', 2017, 2, 11, 0, 0, 'upload/20191219224208.jpeg'),
(21, 'あああ', 'someiyoshino0809@gmail.com', 's11ac02', 'あああ', 'あああ', 'アアア', 'アアア', 2005, 8, 6, 0, 0, 'upload/20200515133451.png'),
(22, 'あああ', 'aaa@gmai.com', '1234gmail', '篠原', '剛', 'アアア', 'オオオオ', 2018, 3, 3, 0, 0, 'upload/20200515133614.png'),
(23, 'あああ', 'aaa@test.com', '1234aaa', 'おおおお', 'おおおお', 'オオオオ', 'オオオオ', 2012, 5, 1, 0, 0, 'upload/20200515134152.jpg'),
(24, 'あああ', 'someiyoshino0809@gmail.com', '１２３４５６７', '篠原', '裕貴', 'しのはら', 'ゆうき', 2019, 3, 4, 0, 0, 'upload/20200628043040.png'),
(25, 'しの', 'sss@gmail.com', 'password', '篠原', '裕貴', 'シノハラ', 'ユウキ', 1988, 8, 9, 0, 0, 'upload/20201222142148.png'),
(26, 'しの', 'shino@gmail.com', 'password', '篠原', 'ゆうき', 'シノハラ', 'ユウキ', 2015, 4, 6, 0, 0, 'upload/20210108035535.jpeg'),
(27, 'しの', 'someiyoshino0809@gmail.com', 'password', '篠原', '裕貴', 'シノハラ', 'ユウキ', 1988, 8, 9, 0, 0, 'upload/20210109015726.jpg'),
(28, 'shino', 'someiyoshino0809@gmail.com', 'password', '篠原', '裕貴', 'シノハラ', 'ユウキ', 1988, 8, 9, 0, 0, 'upload/20210109082744.jpeg'),
(29, 'しの', 'someiyoshino0809@gmail.com', 'password', '篠原', '裕貴', 'シノハラ', 'ユウキ', 2017, 2, 2, 0, 0, 'upload/20210109083404.png');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `user_table`
--
ALTER TABLE `user_table`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルのAUTO_INCREMENT
--

--
-- テーブルのAUTO_INCREMENT `product`
--
ALTER TABLE `product`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=73;

--
-- テーブルのAUTO_INCREMENT `user_table`
--
ALTER TABLE `user_table`
  MODIFY `id` int(128) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
